{
  "Fort Worth": [
    {
      "name": "Presbyterian Night Shelter For Single Women and Children",
      "address": "2400 Cypress St",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76102,
      "phone_number": "(817) 632-7429",
      "email_address": "jglover@journeyhome.org",
      "fax_number": "",
      "official_website": "https://www.journeyhome.org/",
      "twitter": "",
      "facebook": "https://www.facebook.com/PresbyterianNightShelter/",
      "instagram": "https://www.instagram.com/presbyteriannightshelter/",
      "description": "Intake: Come to the shelter's main door at 2400 Cypress Street, Fort Worth, Texas 76102 at 5 p.m. General Shelter Inquiries Main Facility 817-632-7400 Emergency and transitional housing for single women with children and , case management, tutoring, mentoring and educational classes, 3 meals served daily, restrooms with showers, washers/dryers, dispensary items. Eligibility: Homeless women with children, women in last trimester of high risk pregnancy doctor verification required. Women and Children Our Women and Childrens Facility is the only area shelter that allows families with older teenage boys to remain with their mothers, keeping the families together. We also provide a comprehensive children's program, which includes playgrounds, on-site counseling and after-school tutoring. Our capital campaign is increasing our ability to meet growing demand for families, including a new facility to be opened in 2016, expanded support services and enhanced safety and security.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/2843__jvl.jpg",
        "https://www.homelessshelterdirectory.org/gallery/316_presbyteriannightshelter.jpg",
        "https://www.homelessshelterdirectory.org/gallery/2843_journeyhome_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.74457099043977,
      "long": -97.31376997070097
    },
    {
      "name": "SafeHaven Of Tarrant County",
      "address": "1010 N. Center Street",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76011,
      "phone_number": "(817) 535-6462",
      "email_address": "hpreissner@safehaventc.org",
      "fax_number": "",
      "official_website": "https://www.safehaventc.org/",
      "twitter": "https://twitter.com/SafeHavenTC/",
      "facebook": "https://www.facebook.com/safehaventc",
      "instagram": "https://www.instagram.com/safehaventc/",
      "description": "SafeHaven is home to Tarrant County's ONLY two domestic violence shelters. Please call our hotline at 1-877-701-7233 to connect to our resources. Transitional Housing for Victims of Domestic Violence. SafeHaven operates the only domestic violence shelters in Tarrant County. SafeHaven operates two emergency shelters that have a 164 bed capacity and provides 24-hour care to families fleeing life-threatening situations. The shelters provide living quarters, meals, clothing, transportation, counseling, childrens recreational and therapeutic activities, medical and dental care, and case management at no cost to the client.Outreach services include: 24-hour bi-lingual crisis line; counseling and support groups for adults and children (English and Spanish); legal services; collaborative programs with 17 police departments in suburban areas; transitional housing for families exiting the shelter seeking self-sufficiency; and educational programs to adults, children, youth and professionals on prevention and intervention regarding abusive relationships.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/49_safehaventc_org.jpg",
        "https://www.homelessshelterdirectory.org/gallery/49_1622707920.jpg",
        "https://www.homelessshelterdirectory.org/gallery/21_safehaventc.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.86647237511621,
      "long": -97.21049056167517
    },
    {
      "name": "ACH Child and Family Services",
      "address": "3712 Wichita St,",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76119,
      "phone_number": "(817) 335-4673",
      "email_address": "help@achservices.org",
      "fax_number": "",
      "official_website": "https://achservices.org/",
      "twitter": "https://www.twitter.com/achchildfamily",
      "facebook": "https://www.facebook.com/ACHchildandfamily/",
      "instagram": "https://www.instagram.com/achchildandfamily/",
      "description": "Emergency Youth Shelter. No ID/TB card required.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/1871_achservices_org.jpg",
        "https://www.homelessshelterdirectory.org/gallery/1871_1623315524.jpg",
        "https://www.homelessshelterdirectory.org/gallery/fb_490.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.70949301901716,
      "long": -97.27998402774334
    },
    {
      "name": "Tarrant County Samaritan House",
      "address": "929 Hemphill St.",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76104,
      "phone_number": "(817) 332-6410",
      "email_address": "treid@samaritanhouse.org",
      "fax_number": "",
      "official_website": "https://samaritanhouse.org/",
      "twitter": "https://twitter.com/SamHouseTC",
      "facebook": "https://www.facebook.com/SamaritanhouseFW",
      "instagram": "https://www.instagram.com/samaritanhousefw",
      "description": "Samaritan House:Our single-room occupancy (SRO) facility is a permanent housing environment for single men and women living with HIV/AIDS in a service enriched community of care providing 60 one-person units and supportive services. Qualifications: Applicants must be 18 years of age or older, living with HIV/AIDS, low income and homeless. Rent: Applicants are required to pay 30% of their annual adjusted income towards their rent. All utilities are included in the rent. Contact Crystal Daniel, Intake Coordinator, at 817-332-6410 ext. 172 or cdaniel@samaritanhouse.org for more information.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/877__fbl.jpg",
        "https://www.homelessshelterdirectory.org/gallery/877_samaritanhouse_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.73445197974074,
      "long": -97.33110701541003
    },
    {
      "name": "Cornerstone Assistance Network",
      "address": "3500 Noble Avenue",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76111,
      "phone_number": "(817) 632-6000",
      "email_address": "kdoyle@canetwork.org",
      "fax_number": "(817) 632-6001",
      "official_website": "http://www.canetwork.org/",
      "twitter": "https://twitter.com/CANUpdate",
      "facebook": "https://www.facebook.com/canetwork",
      "instagram": "https://www.instagram.com/canetwork/",
      "description": "Housing Solutions &amp; Development Cornerstone has been helping men, women, and families find stability in their lives by meeting their housing needs since 1994. Eliminating housing barriers allows all people the opportunity to move forward and become more stable and productive members of our community. Our housing efforts focus on the individual who may be facing challenges with housing solutions. Our goal is to move individuals from insecurity in housing to a variety of permanent solutions including home ownership. Our goal is not to transition those in need into a living space, but to work with them toward their long term goals for life and housing desires. Over 25 properties have been made available since 2014 for affordable ownership. Many of them are now owned by individuals and families who once saw homeownership as an unreachable dream. Our current housing division includes three distinct avenues to sustained living. For men, the New Life Center in the up-and-coming Fairmount Historic District offers housing for men who have faced homelessness. Women who are being released from incarceration can become part of the Promise House, a place that provides safe shelter while working toward building a new life based upon Christian principles. We work to provide affordable homes to individuals and families who are ready and willing to achieve this goal. New Life Center New Life Center is a home where men who have faced homelessness can focus on education and meeting their long-term career goals. During their residence, each man is provided supportive services such as case management, mentoring, and spiritual, physical, emotional, and financial guidance. Despite where these men may come from, their future possibilities are limitless. Residents graduate from college every year, including one resident who graduated as Valedictorian from TCU. Those interested in being a resident may complete the application and interview process in person, Monday mornings at 9:30 am. No appointment is necessary. Applicants must be currently homeless and drug- and alcohol-free. 1628 Sixth Ave. Fort Worth, Texas 76104",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/235_1622799850.jpg",
        "https://www.homelessshelterdirectory.org/gallery/fb_1086.jpg",
        "https://www.homelessshelterdirectory.org/gallery/107_canetwork.jpg",
        "https://www.homelessshelterdirectory.org/gallery/235_canetwork_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.769506984748645,
      "long": -97.2969360078205
    },
    {
      "name": "Presbyterian Night Shelter",
      "address": "2400 Cypress Street",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76102,
      "phone_number": "(817) 632-7400",
      "email_address": "towen@journeyhome.org",
      "fax_number": "",
      "official_website": "http://journeyhome.org/",
      "twitter": "https://twitter.com/@_JourneyHome",
      "facebook": "https://www.facebook.com/PresbyterianNightShelter/",
      "instagram": "https://www.instagram.com/presbyteriannightshelter/",
      "description": "Long term emergency shelter for general population. Dinner is served to all overnight guests. 5:00 pm to 6:30 pm daily.Services: Single Men and Women Our shelter for homeless adults operates 24 hours a day, and 365 days a year. Housing, meals and additional support services are available for single women and single men. We are free to anyone in need, and we are the only shelter in our area without length-of-stay restrictions.Women and Children Our Women and Children's Facility is the only area shelter that allows families with older teenage boys to remain with their mothers, keeping the families together. We also provide a comprehensive children's program, which includes playgrounds, on-site counseling and after-school tutoring. Our capital campaign is increasing our ability to meet growing demand for families, including a new facility to be opened in 2016, expanded support services and enhanced safety and security.Veterans We have one of the most successful transitional housing programs for veterans in the United States, preparing them for permanent, independent housing within 12 months. We have developed semiprivate facilities for veterans, allowing them to prepare their own meals and have separate recreation, as well as access to showers, laundry services and a computer lab. We work with Veterans Affairs to secure and retain employment for homeless veteran clients, move them into permanent housing and eliminate or minimize barriers to continued self-sufficiency.Mentally Ill/Behaviorally Disabled Our Behavioral Care Facility provides services for severely mentally ill homeless, who often suffer from substance abuse issues. We work with mentally ill homeless to live in furnished, private rooms in a residential facility. MHMR Tarrant County collaborates with us to provide health care services.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/690__xwj.jpg",
        "https://www.homelessshelterdirectory.org/gallery/690__cgm.jpg",
        "https://www.homelessshelterdirectory.org/gallery/316_presbyteriannightshelter.jpg",
        "https://www.homelessshelterdirectory.org/gallery/690_journeyhome_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.74457099043977,
      "long": -97.31376997070097
    },
    {
      "name": "Union Gospel Mission of Tarrant County",
      "address": "1321 East Lancaster Avenue",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76102,
      "phone_number": "(817) 339-2553",
      "email_address": "lkinney@ugm-tc.org",
      "fax_number": "",
      "official_website": "https://www.ugm-tc.org/",
      "twitter": "https://www.twitter.com/ugmtarrantco",
      "facebook": "https://www.facebook.com/pages/Union-Gospel-Mission-of-Tarrant-County/132706556836155?ref=hl",
      "instagram": "https://www.instagram.com/ugmtarrantco/",
      "description": "UGM-TC provides emergency services for the homeless living in Tarrant County. We offer breakfast, lunch and dinner every day for those in need. In addition, overnight shelter for men is available.Meal Times for Outside Guests:Breakfast: 7:00amLunch: 12:30pmDinner: 6:00pmGuests line up to enter the building 45 minutes prior to meal times in order to enter the chapel. Meal times remain consistent throughout the year, except for certain holidays.Overnight Shelter for Men:Check in occurs at 7:00pm every day at the main entrance of the Men's Building located at 1331 E. Lancaster. An ID and proof of a TB test within the past year will be needed in order to spend the night. When temperatures are over 90 degrees or under 40, we accommodate as many people as possible and work with other shelters and agencies to find additional space. Men staying overnight can be shifted to the Resident Program should they choose and if space is available.Mens Program:The men's program serves men 18 years of age and older with a focus on intensive supportive services to address mental health, substance use, education, employment, transportation, and other needs to give men the greatest chance of developing the skills and self-confidence to attain self-sufficiency. The skill-building program provides them with the communication, relationship building, and social skills necessary to maintain stable employment.Requirements for Admission to Mens Building: Male 18 years of age or older Capable of independent living throughout their stay Complete an admission application, including a complete and factual disclosure of mental and physical history. Failure to disclose this information will cause the application for admission to be denied. Have or obtain a legal state identification and Social Security card Provide a list of prescription medications to the case manager or facility manager. This list should be updated any time a new prescription is given after becoming a resident. Receive treatment for any communicable disease or condition (such as lice) which pertains to the applicant, before introduced into the communal environment. Have a current TB card issued by a local shelter or obtain a TB test at the next testing date.To learn about our intake procedures &amp; fees, please call: 817.332.3019Upon entering the program, a professional social worker conducts a face-to-face comprehensive assessment with each client. Together, they identify the clients strengths and challenges while establishing a trusting and empowering relationship. This is done through a case management plan designed to address the physical, emotional, spiritual and social needs for each client.Womens Program:The women's programs serves women 18 years of age and older with a focus on helping women in crisis discover their new path for permanent change toward healing, empowerment, self-supportiveness and fulfillment of their God-given potential. Women are provided classes on domestic violence, personal empowerment, and budgeting and computer skills. Case managers are their advocates linking them to economic opportunities, strong social services and effective supportive services. Women receive direction on personal responsibility; self-management; goal-directed behavior; decision-making; and relationship skills.Family Program:Our families program serves mothers with children, fathers with children and intact families with children. The family program focuses on keeping families together and providing them with a safe, whole and supported environment. The onsite case managers encourage, educate and empower parents while helping them develop critical skills for a healthy strong family foundation. Life skills classes are provided including parenting classes, early childhood reading classes, cooking a healthy meal, more than budgets, personal social adjustment groups, grief and loss groups, and numerous other classes as needed.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/942_tx_union-gospel-mission-of-tarrant-county_sdg.jpg",
        "https://www.homelessshelterdirectory.org/gallery/942_ugm-tc_org.jpg",
        "https://www.homelessshelterdirectory.org/gallery/942__fsu.jpg",
        "https://www.homelessshelterdirectory.org/gallery/942__eht.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.746505994697344,
      "long": -97.31537896083452
    },
    {
      "name": "The Salvation Army Fort Worth Shelter",
      "address": "1855 E. Lancaster",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76103,
      "phone_number": "(817) 344-1800",
      "email_address": "",
      "fax_number": "",
      "official_website": "http://fortworth.satruck.org/",
      "twitter": "",
      "facebook": "https://www.facebook.com/SalvationArmyUSA",
      "instagram": "https://www.instagram.com/salvationarmyus/",
      "description": "Day and Night Shelter. Prepared meals provided. Breakfast at 7:30am, Lunch at 12:30pm, and dinner at 5:30pm. Emergency Shelter 817-334-2495 Family Center 817-344-1800 Ext.4 First Choice Substance Abuse/Women and children 817-344-1831 Northside Corps/Community Center 817-624-3111",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/354_salvationarmyus.jpg",
        "https://www.homelessshelterdirectory.org/gallery/1870_1650363697.jpg",
        "https://www.homelessshelterdirectory.org/gallery/1870_fortworth_satruck_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.74673100688808,
      "long": -97.30131597132484
    },
    {
      "name": "SafeHaven of Tarrant County - Victims and Their Children",
      "address": "1100 Hemphill Street, Suite 303",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76104,
      "phone_number": "(877) 701-7233",
      "email_address": "hpreissner@safehaventc.org",
      "fax_number": "",
      "official_website": "http://www.safehaventc.org/",
      "twitter": "https://twitter.com/squarespace",
      "facebook": "https://www.facebook.com/safehaventc",
      "instagram": "https://www.instagram.com/safehaventc",
      "description": "24 hour Domestic violence hotline for women and their children. SafeHaven operates the largest and most comprehensive domestic violence shelters in Tarrant County. Services EMERGENCY SHELTER Provides 24-hour care to families fleeing life-threatening situations. Includes a secure living environment, legal services, professional counseling, transportation to and from work, on-site school and daycare, and medical and dental referrals. 24 HOUR HOTLINE Provides counseling, information and referrals. Services are provided in English and Spanish and all calls are confidential and free of charge. SAFE LIVING HOUSING Gives clients skills and tools necessary to move from the shelter to independent living. The average stay ranges from 3 months to 2 years. OUTREACH PROGRAMS Include counseling and support groups for adults and children in English and Spanish, legal services, and collaboration with area police departments. PREVENTION &amp; EDUCATION PROGRAMS Include programs about healthy relationships, safe dating, bullying, and other relevant topics for adults, children, teens and professionals. In 2016, SafeHaven educated over 30,000 students in Tarrant County school districts. PARTNER ABUSE AND INTERVENTION PROGRAM Helps abusive individuals identify belief systems that form the core of abusive behaviors. paip equips abusers with tools to help them recognize and avoid aggressive and violent behaviors in the future and teaches healthy replacement options.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/1869_1623330682.jpg",
        "https://www.homelessshelterdirectory.org/gallery/1869_safehaventc_org.jpg",
        "https://www.homelessshelterdirectory.org/gallery/21_safehaventc.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.73253801406014,
      "long": -97.33246999668538
    },
    {
      "name": "Fort Worth YWCA Temporary Shelter For Women",
      "address": "512 W. 4th St.",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76102,
      "phone_number": "(817) 332-6191",
      "email_address": "arlingtoncdc@ywcafortworth.org",
      "fax_number": "",
      "official_website": "http://www.ywcafortworth.org",
      "twitter": "https://www.twitter.com/TransformingTC",
      "facebook": "http://www.facebook.com/#!/pages/YWCA-Fort-Worth-Tarrant-County/209801975378",
      "instagram": "",
      "description": "Temporary emergency shelter for single female only.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/335_1629249951.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.75297497993007,
      "long": -97.33491600367005
    },
    {
      "name": "Huma-Faith",
      "address": "1617 Park Pl Ave Suite 110",
      "city": "Fort Worth",
      "state": "TX",
      "zip_code": 76110,
      "phone_number": "(682) 304-8020",
      "email_address": "info@humafaith.org",
      "fax_number": "(682) 233-0559",
      "official_website": "http://www.humafaith.org",
      "twitter": "https://twitter.com/humafaith",
      "facebook": "https://www.facebook.com/HumaFaith",
      "instagram": "",
      "description": "Transitional Housing for the homeless population. We provide for men, women, and minor children. There's financial responsibility and obligation that may be off-set or in some cases eliminated through our work program.Faith-Based transitional housing serving the homeless population, manageable mental health clients, refugees, victims of domestic violence, and persons released from prisons and jails with nowhere to go.",
      "photo_urls": [
        "https://www.homelessshelterdirectory.org/gallery/3099_tx_huma-faith_iuj.fna&oh=e8d94959478c0c14d131eb5a2cee2d69&oe=6180197A",
        "https://www.homelessshelterdirectory.org/gallery/3099_tx_huma-faith_ebu.fna&oh=3f466815e9928bc0e8a0daf0441b82d7&oe=6180D5C8",
        "https://www.homelessshelterdirectory.org/gallery/3099_humafaith_org.jpg"
      ],
      "update_datetime": "2023-06-21T17:24:12Z",
      "lat": 32.72550501056271,
      "long": -97.34485601882676
    }
  ]
}