{"Laredo": [{"name": "The Salvation Army Laredo Men's Shelter", "address": "408 Matamoros St", "city": "Laredo", "state": "TX", "zip_code": "78040", "location": "27.506461994492668,-99.49990702769715", "phone_number": "(956) 723-2349", "email_address": "saauxiliaryofhoodcounty@gmail.com", "fax_number": "", "official_website": "https://www.salvationarmytexas.org/laredo/", "twitter": "https://twitter.com/SalArmyTX", "facebook": "https://www.facebook.com/SalArmyTX", "instagram": "https://www.instagram.com/salarmytx", "description": "Provides shelter for men only. Accommodates for the night only not an all day shelter. Showers are made available to those who will be staying the night. Lodge registration starts at 6:00pm lights out by 10:00pm.Walk-Ins Accepted (without prior phone call), call for informationHours: Daily 6:00pm - 10:00pmOther Services provided at the Laredo Salvation Army: The Salvation Army Soup KitchenThe Salvation Army Christmas AssistanceThe Salvation Army Family Emergency ServiceThe Salvation Army Disaster Service and Emergency ServicesThe Salvation Army Summer Camp", "photo_urls": ["https://www.homelessshelterdirectory.org/gallery/2797_salvationarmytexas_org.jpg"], "update_datetime": "2023-06-21T17:24:12Z"}, {"name": "Bethany House Transitional Housing For Families", "address": "815 Hidalgo St", "city": "Laredo", "state": "TX", "zip_code": "78040", "location": "27.5047020043734,-99.50413796096302", "phone_number": "(956) 717-0882", "email_address": "info@bethanyhouseoflaredo.org", "fax_number": "", "official_website": "http://www.bethanyhouseoflaredo.org/", "twitter": "https://twitter.com/News_Photogs", "facebook": "https://www.facebook.com/Bethany-House-of-Laredo-200652035118/about", "instagram": "https://www.instagram.com/icsporg", "description": "Bethany House is operated by the Homeless Coalition it provides twenty beds for males, eight beds for females and two efficiency units for homeless families. If needed, the Resource Center can converted into an efficiency unit at night. The term of stay is 15 days of every 30 days, except for families who might need more time to stabilize their lives.Eligibility: Homeless families and individuals needing a place to stay temporarily due to hardship situations.Hours: Mon - Sun 6:00pm - 7:00am; Registration 6:00pm - 8:30pmEMERGENCY SHELTERThe emergency shelters provide short term housing to men and women that need a place to stay, shower and store their personal belongings. Terms of stay are generally 30 days after they undergo an intake process.The Lamar Bruni Vergara Emergency Shelter has capacity for 10 women, while the Barbara A. Kazen Center for Hope has 28 beds for men.In 2013, shelter was provided to 2,392 clients (43,056 beds were occupied).During extreme weather conditions, where demand for emergency shelter is higher, our resource center and other available rooms are temporarily conditioned for this purpose.", "photo_urls": ["https://www.homelessshelterdirectory.org/gallery/2792__mhz.jpg", "https://www.homelessshelterdirectory.org/gallery/2792_bethanyhouseoflaredo_org.jpg"], "update_datetime": "2023-06-21T17:24:12Z"}]}